#+TITLE: April 6-18, 2019 (13 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2019-04-06 Sat>
  :wpd-gandalfdwite: 2
  :wpd-sandeepk: 1.2
  :wpd-sidntrivedi: 1
  :wpd-jasonbraganza: 3
  :END:
** gandalfdwite
*** Read Kubernetes Docs
   :PROPERTIES:
   :ESTIMATED: 10
   :ACTUAL:
   :OWNER: gandalfdwite
   :ID: READ.1554610265
   :TASKID: READ.1554610265
   :END:
   - [ ] Kubernetes Overview                      ( 2h)
   - [ ] Kubernetes Architecture                  ( 2h)
   - [ ] Containers                               ( 2h)
   - [ ] Workloads                                ( 1h)
   - [ ] Services, Load Balancing, Networking     ( 3h)
*** Learn dgplug logs
   :PROPERTIES:
   :ESTIMATED: 7
   :ACTUAL:
   :OWNER: gandalfdwite
   :ID: READ.1554610334
   :TASKID: READ.1554610334
   :END:
     - [ ] Part 3. Search Functions      ( 1h)
     - [ ] Part 4. Shell mode commands   ( 1h)
     - [ ] Part 5. Dired mode            ( 1h)
     - [ ] Part 6. Info Commands         ( 1h)
     - [ ] Part 7. Calculator in emacs   ( 1h)
     - [ ] Part 8. Org mode in emacs     ( 2h)
*** Data Structure and Algorithmic Thinking with Python (By Narsimha Karumanchi)
   :PROPERTIES:
   :ESTIMATED: 5
   :ACTUAL:
   :OWNER: gandalfdwite
   :ID: READ.1554610422
   :TASKID: READ.1554610422
   :END:
    - [ ] 1. Introduction                      ( 2h)
    - [ ] 2. Recursion & Backtracking          ( 1h)
    - [ ] 3. Linked Lists                      ( 1h)
    - [ ] 4. Stacks                            ( 1h)

** sandeepk
*** Stacknews [0/3]
    :PROPERTIES:
    :ESTIMATED: 9
    :ACTUAL:
    :OWNER: sandeepk
    :ID: DEV.1552226887
    :TASKID: DEV.1552226887
    :END:
    - [ ] Design/CSS work for the landing page, Login page, Post submit page 5h
    - [ ] Logic for comment on post and tab 2h 
    - [ ] Logic for thread post linkage 2h
*** Sapiens Book Reading [0/1]
    :PROPERTIES:
    :ESTIMATED: 6.5
    :ACTUAL:
    :OWNER: sandeepk
    :ID: READ.1554403369
    :TASKID: READ.1554403369
    :END:
    - [ ] Everyday 1/2 hour reading 6.5h

** sidntrivedi
*** TODO Learn Javascript [0/5]
   :PROPERTIES:
   :ESTIMATED: 6
   :ACTUAL:
   :OWNER: sidntrivedi
   :ID: READ.1554709767
   :TASKID: READ.1554709767
   :END:
   - [ ] ES6
   - [ ] Regular Expressions
   - [ ] Debugging
   - [ ] Basic Data Structures
   - [ ] Basic ALgorithm Scripting
*** TODO Read Linux for you and me [0/4]
   :PROPERTIES:
   :ESTIMATED: 5
   :ACTUAL:
   :OWNER: sidntrivedi
   :ID: READ.1554709804
   :TASKID: READ.1554709804
   :END:
   - [ ] File Permissions
   - [ ] Processes in Linux
   - [ ] Linux Services
   - [ ] Package Management
*** TODO Blog [0/1]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: sidntrivedi
    :ID: WRITE.1539072660
    :TASKID: WRITE.1539072660
    :END:      
    - [ ] Write one blog on ES6 features.
** jasonbraganza
*** IN_PROGRESS NIOS Maths Text Book - Part V [0/7]
   :PROPERTIES:
   :ESTIMATED: 39
   :ACTUAL:   5.95
   :OWNER: jasonbraganza
   :ID: READ.1552291497
   :TASKID: READ.1552291497
   :END:
   :LOGBOOK:
   CLOCK: [2019-04-08 Mon 10:00]--[2019-04-08 Mon 12:53] =>  2:53
   CLOCK: [2019-04-07 Sun 14:44]--[2019-04-07 Sun 16:25] =>  1:41
   CLOCK: [2019-04-07 Sun 11:46]--[2019-04-07 Sun 13:09] =>  1:23
   :END:
    - [-] Module - IV: Co-ordinate Geometry [1/4]
      - [X] 13 - Cartesian System of Rectangular Co-ordinates
      - [ ] 14 - Straight Lines
      - [ ] 15 - Circles
      - [ ] 16 - Conic Sections
    - [ ] Module - V: Statistics and Probability [0/3]
      - [ ] 17 - Measures of Dispersion
      - [ ] 18 - Random Experiments and Events
      - [ ] 19 - Probability
    - [ ] Module - VI: Algebra II [0/3]
      - [ ] 20 - Matrices
      - [ ] 21 - Determinants
      - [ ] 22 - Inverse of a Matrix and its Applications
    - [ ] Module - VII: Relations and Functions [0/2]
      - [ ] 23 - Relations and Functions II
      - [ ] 24 - Inverse Trigonometric Functions
    - [ ] Module - VIII: Calculus [0/8]
      - [ ] 25 -  Limits and Continuity
      - [ ] 26 - Differentiation
      - [ ] 27 - Differentiation of Trigonometric Functions
      - [ ] 28 - Differentiation of Exponential and Logarithmic functions
      - [ ] 29 - Application of Derivatives
      - [ ] 30 - Integration
      - [ ] 31 - Definite Integrals
      - [ ] 32 - Differential Integrals
    - [ ] Module - IX: Vectors and Three Dimensional Geometry [0/4]
      - [ ] 33 - Introduction to Three Dimensional Geometry
      - [ ] 34 - Vectors
      - [ ] 35 - Plane
      - [ ] 36 - Straight Line
    - [ ] Module - X: Linear Programming and Mathematical Reasoning [0/2]
      - [ ] 37 - Linear Programming
      - [ ] 38 - Mathematical Reasoning

